CREATE DATABASE IF NOT EXISTS `calendar_db` CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;

USE `calendar_db`;

DROP TABLE IF EXISTS `calendar`;

CREATE TABLE `calendar` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL,
  `day` tinyint(4) NOT NULL,
  `comment` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `date` (`date`),
  KEY `idx_day_date` (`day`,`date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `calendar` (date, day, comment) VALUES
('2024-01-01', 9, 'Новогодние каникулы'),
('2024-01-02', 9, 'Новогодние каникулы'),
('2024-01-03', 9, 'Новогодние каникулы'),
('2024-01-04', 9, 'Новогодние каникулы'),
('2024-01-05', 9, 'Новогодние каникулы'),
('2024-01-06', 9, 'Новогодние каникулы'),
('2024-01-08', 9, 'Новогодние каникулы'),
('2024-01-07', 9, 'Рождество Христово'),
('2024-02-23', 9, 'День защитника Отечества'),
('2024-03-08', 9, 'Международный женский день'),
('2024-05-01', 9, 'Праздник Весны и Труда'),
('2024-05-09', 9, 'День Победы'),
('2024-06-12', 9, 'День России'),
('2024-11-04', 9, 'День народного единства'),
('2024-02-22', 8, NULL),
('2024-03-07', 8, NULL),
('2024-05-08', 8, NULL),
('2024-06-11', 8, NULL),
('2024-11-02', 8, NULL),
('2024-05-10', 7, 'Перенос с субботы 6 января'),
('2024-12-31', 1, 'Перенос с воскресенья 7 января'),
('2024-04-27', 2, 'Перенос с понедельника 29 апреля'),
('2024-04-29', 7, 'Перенос с субботы 27 апреля'),
('2024-04-30', 7, 'Перенос с субботы 2 ноября'),
('2024-12-28', 2, 'Перенос с понедельника 30 декабря'),
('2024-12-30', 7, 'Перенос с субботы 28 декабря');